// @flow

export const incomeStatements = [{
  id: 1,
  name: '營業成本',
}, {
  id: 2,
  name: '毛利',
}, {
  id: 3,
  name: '銷售費用',
}, {
  id: 4,
  name: '管理費用',
}, {
  id: 5,
  name: '研發費用',
}, {
  id: 6,
  name: '營業外收益',
}, {
  id: 7,
  name: '稅前淨利',
}, {
  id: 8,
  name: '歸屬於母公司淨利',
}, {
  id: 9,
  name: '每股盈餘',
}, {
  id: 10,
  name: '營業活動',
}, {
  id: 11,
  name: '投資活動',
}, {
  id: 12,
  name: '自由現金流',
}, {
  id: 13,
  name: '經營績效',
}, {
  id: 14,
  name: '股東權益報酬率',
}, {
  id: 15,
  name: '毛利率',
}, {
  id: 16,
  name: '營業利益率',
}, {
  id: 17,
  name: '淨利率',
}, {
  id: 18,
  name: '股息',
}, {
  id: 19,
  name: '現金股利',
}, {
  id: 20,
  name: '股票股利',
}, {
  id: 21,
  name: '股利合計',
}];

// export const stocks = [{
//   id: 1,
//   name: 'stock1',
//   income: {
//     year: {
//     },
//     quarter: [{
//     }],
//   },
//   balance: {
//     1. 現金及約當現金
//     2. 短期投資
//     3. 應收帳款
//     4. 存貨
//     5. 長期資產
//     6. 固定資產
//     7. 其他資產
//     8. 短期借款
//     9. 應付帳款
//     10. 長期負債
//     11. 其他負債
//   },
//   cashFlow: {
//     1. 現金及約當現金
//     2. 短期投資
//     3. 應收帳款
//     4. 存貨
//     5. 長期資產
//     6. 固定資產
//     7. 其他資產
//     8. 短期借款
//     9. 應付帳款
//     10. 長期負債
//     11. 其他負債
//   },
//   dividend: {
//     1. id
//     2. 年度／季度
//     3. 董事會日期
//     4. 股東會日期
//     5. 除息日
//     6. 除權日
//     7. 現金股利發放日
//     8. 現金股利(元/股)
//     9. 股票股利(元/股)
//   },
// }];

export default null;
